Catalogs/ПортфелиСодержание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПортфелиСодержание</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РеестрыПортфеля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реестр</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПортфелиСодержание/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РеестрыПортфеляРеестрПриИзменении(Элемент)
	
	
	    пр= Элементы.РеестрыПортфеля.ТекущиеДанные;
		
		НомерРеестра=НомерРеестра(пр.Реестр);

		пр.НомерРеестра=НомерРеестра;
				
		
КонецПроцедуры


&НаСервере
Функция НомерРеестра(реестр)
	
	 номерРеестра="";
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Реестр.НомерДляПечати КАК Номер
						|ИЗ
						|	Документ.Реестр КАК Реестр
						|ГДЕ
						|	Реестр.Ссылка = &Ссылка";
					
					Запрос.УстановитьПараметр("Ссылка", реестр);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						номерРеестра=ВыборкаДетальныеЗаписи.Номер;
					КонецЦикла;
					
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
   Возврат  номерРеестра;
					
КонецФункции // ()


&НаКлиенте
Процедура Добавить(Команда)
	// Вставить содержимое обработчика.
	     СтандартнаяОбработка = Ложь;
		 
		 ПараметрыФормы  = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина);
         ОбработкаВыбора = Новый ОписаниеОповещения("ВыбратьЭлементСправочника", ЭтаФорма);
	  
		 
		  формаЭ=ОткрытьФорму("Документ.Реестр.Форма.ФормаВыбора1",ПараметрыФормы,,,,,ОбработкаВыбора);
		
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьЭлементСправочника(РезультатЗакрытия,ДопПараметры) Экспорт

			Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
			   Возврат;
			КонецЕсли;

			
			Для каждого стр Из РезультатЗакрытия  Цикл
				  трокаТаб=Объект.РеестрыПортфеля.Добавить();
				  трокаТаб.Реестр=стр;
				  трокаТаб.НомерРеестра=НомерРеестра(стр);
				
				
			
			КонецЦикла; 
			
			
			
КонецПроцедуры
